<a href="https://colab.research.google.com/github/dubba1212/AIML/blob/master/Assignment_10(06_06_2020).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. If you find Unnamed column in the data remove that by filtering

In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv("https://raw.githubusercontent.com/kotagiri-preeti/Summer-Internship-AI-and-ML/master/german_credit_data.csv",index_col=0,nrows=10)
df

   Age     Sex  Job  ... Credit amount Duration              Purpose
0   67    male    2  ...          1169        6             radio/TV
1   22  female    2  ...          5951       48             radio/TV
2   49    male    1  ...          2096       12            education
3   45    male    2  ...          7882       42  furniture/equipment
4   53    male    2  ...          4870       24                  car
5   35    male    1  ...          9055       36            education
6   53    male    2  ...          2835       24  furniture/equipment
7   35    male    3  ...          6948       36                  car
8   61    male    1  ...          3059       12             radio/TV
9   28    male    3  ...          5234       30                  car

[10 rows x 9 columns]

In [6]:
df.dropna(axis=1,inplace=True)
df

   Age     Sex  Job Housing  Credit amount  Duration              Purpose
0   67    male    2     own           1169         6             radio/TV
1   22  female    2     own           5951        48             radio/TV
2   49    male    1     own           2096        12            education
3   45    male    2    free           7882        42  furniture/equipment
4   53    male    2    free           4870        24                  car
5   35    male    1    free           9055        36            education
6   53    male    2     own           2835        24  furniture/equipment
7   35    male    3    rent           6948        36                  car
8   61    male    1     own           3059        12             radio/TV
9   28    male    3     own           5234        30                  car

2. Display the top seven rows and last Three rows

In [7]:
df.head(7)

   Age     Sex  Job Housing  Credit amount  Duration              Purpose
0   67    male    2     own           1169         6             radio/TV
1   22  female    2     own           5951        48             radio/TV
2   49    male    1     own           2096        12            education
3   45    male    2    free           7882        42  furniture/equipment
4   53    male    2    free           4870        24                  car
5   35    male    1    free           9055        36            education
6   53    male    2     own           2835        24  furniture/equipment

In [8]:
df.tail(3)

   Age   Sex  Job Housing  Credit amount  Duration   Purpose
7   35  male    3    rent           6948        36       car
8   61  male    1     own           3059        12  radio/TV
9   28  male    3     own           5234        30       car

3. Check the total number of entries you have

In [9]:
df.shape[0]

10

4. Check the No of features,Print features Names(Column Names)

In [12]:
print("number of columns",df.shape[1])
print("column names")
for col in df.columns:
   print(col)

number of columns 7
column names
Age
Sex
Job
Housing
Credit amount
Duration
Purpose

5. Print the row indices of the dataframe

In [13]:
list(df.head(10).index.values.tolist())

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

6. Check the dtype of each and every columns

In [14]:
df.dtypes

Age               int64
Sex              object
Job               int64
Housing          object
Credit amount     int64
Duration          int64
Purpose          object
dtype: object

7. Description for Numerical Column min,max,count,25%,50%,75%,std

In [10]:
df.describe()

            Age        Job  Credit amount   Duration
count  10.00000  10.000000      10.000000  10.000000
mean   44.80000   1.900000    4909.900000  27.000000
std    14.53578   0.737865    2603.480852  13.928388
min    22.00000   1.000000    1169.000000   6.000000
25%    35.00000   1.250000    2891.000000  15.000000
50%    47.00000   2.000000    5052.000000  27.000000
75%    53.00000   2.000000    6698.750000  36.000000
max    67.00000   3.000000    9055.000000  48.000000

8. Description for the categorical Columns count,top,freq

In [15]:
df.describe(include='all')

             Age   Sex        Job Housing  Credit amount   Duration Purpose
count   10.00000    10  10.000000      10      10.000000  10.000000      10
unique       NaN     2        NaN       3            NaN        NaN       4
top          NaN  male        NaN     own            NaN        NaN     car
freq         NaN     9        NaN       6            NaN        NaN       3
mean    44.80000   NaN   1.900000     NaN    4909.900000  27.000000     NaN
std     14.53578   NaN   0.737865     NaN    2603.480852  13.928388     NaN
min     22.00000   NaN   1.000000     NaN    1169.000000   6.000000     NaN
25%     35.00000   NaN   1.250000     NaN    2891.000000  15.000000     NaN
50%     47.00000   NaN   2.000000     NaN    5052.000000  27.000000     NaN
75%     53.00000   NaN   2.000000     NaN    6698.750000  36.000000     NaN
max     67.00000   NaN   3.000000     NaN    9055.000000  48.000000     NaN

9. Missing value count column wise

In [16]:
df.isnull().sum()

Age              0
Sex              0
Job              0
Housing          0
Credit amount    0
Duration         0
Purpose          0
dtype: int64

10. Check the output for the info function

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Age            10 non-null     int64
 1   Sex            10 non-null     object
 2   Job            10 non-null     int64
 3   Housing        10 non-null     object
 4   Credit amount  10 non-null     int64
 5   Duration       10 non-null     int64
 6   Purpose        10 non-null     object
dtypes: int64(4), object(3)
memory usage: 640.0+ bytes

11. Access particular rows and columns using iloc,loc

In [18]:
df.iloc[:,1]

0      male
1    female
2      male
3      male
4      male
5      male
6      male
7      male
8      male
9      male
Name: Sex, dtype: object

In [19]:
df.loc[:2]

   Age     Sex  Job Housing  Credit amount  Duration    Purpose
0   67    male    2     own           1169         6   radio/TV
1   22  female    2     own           5951        48   radio/TV
2   49    male    1     own           2096        12  education

12. How many unique values are there in a particular column

In [20]:
df['Age'].nunique()

8